In [ ]:
import pandas as pd

##### Series

In [7]:
ser1=pd.Series(data=[100,90,75,88,65],index=['Ajay','Sanjay','Ramesh','Ramya','Suman'])
ser1

Ajay      100
Sanjay     90
Ramesh     75
Ramya      88
Suman      65
dtype: int64

In [5]:
type(ser1)

pandas.core.series.Series

In [6]:
ser1.ndim

1

In [8]:
ser1['Ramya']

np.int64(88)

In [10]:
ser1[:3]

Ajay      100
Sanjay     90
Ramesh     75
dtype: int64

In [9]:
ser1['Ajay':'Ramesh']

Ajay      100
Sanjay     90
Ramesh     75
dtype: int64

In [11]:
ser1[['Ajay','Ramesh']]

Ajay      100
Ramesh     75
dtype: int64

In [12]:
ser1

Ajay      100
Sanjay     90
Ramesh     75
Ramya      88
Suman      65
dtype: int64

In [13]:
ser1.max()

100

In [14]:
ser1.min()

65

In [15]:
ser1.mean()

np.float64(83.6)

In [16]:
ser1.median()

88.0

In [17]:
ser1.mode()

0     65
1     75
2     88
3     90
4    100
dtype: int64

In [18]:
ser1

Ajay      100
Sanjay     90
Ramesh     75
Ramya      88
Suman      65
dtype: int64

In [20]:
ser1[ser1<90]

Ramesh    75
Ramya     88
Suman     65
dtype: int64

In [22]:
ser1[ser1==100]

Ajay    100
dtype: int64

#### DataFrame

In [ ]:
dict1={'Name':['Ajay','Sanjay','Ramesh','Ramya','Suman'],'Age':[22,21,31,24,28],
       'Gender':['Male','Male','Male','Female','Female'],
       'Location':['Bengaluru','Pune','Chennai','Bengaluru','Mumbai']}

In [32]:
dict1

{'Name': ['Ajay', 'Sanjay', 'Ramesh', 'Ramya', 'Suman'],
 'Age': [22, 21, 31, 24, 28],
 'Gender': ['Male', 'Male', 'Male', 'Female', 'Female'],
 'Location': ['Bengaluru', 'Pune', 'Chennai', 'Bengaluru', 'Mumbai']}

In [48]:
df= pd.DataFrame(dict1,index=range(1,6))
df.index.name='SNo'

In [49]:
df.shape

(5, 4)

In [50]:
df.ndim

2

In [51]:
df.size

20

In [52]:
df

       Name  Age  Gender   Location
SNo
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [53]:
df.columns

Index(['Name', 'Age', 'Gender', 'Location'], dtype='object')

In [55]:
df.sort_values(by='Age',ascending=False)

       Name  Age  Gender   Location
SNo
3    Ramesh   31    Male    Chennai
5     Suman   28  Female     Mumbai
4     Ramya   24  Female  Bengaluru
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 1 to 5
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      5 non-null      object
 1   Age       5 non-null      int64
 2   Gender    5 non-null      object
 3   Location  5 non-null      object
dtypes: int64(1), object(3)
memory usage: 292.0+ bytes

In [58]:
df.describe(include='all')

        Name        Age Gender   Location
count      5   5.000000      5          5
unique     5        NaN      2          4
top     Ajay        NaN   Male  Bengaluru
freq       1        NaN      3          2
mean     NaN  25.200000    NaN        NaN
std      NaN   4.207137    NaN        NaN
min      NaN  21.000000    NaN        NaN
25%      NaN  22.000000    NaN        NaN
50%      NaN  24.000000    NaN        NaN
75%      NaN  28.000000    NaN        NaN
max      NaN  31.000000    NaN        NaN

In [59]:
df

       Name  Age  Gender   Location
SNo
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [65]:
## df.drop(columns=['Location'],inplace=True)

In [68]:
df.rename(columns={'Location':'Place'},inplace=True)

In [71]:
df[df.Gender=='Male']

       Name  Age Gender      Place
SNo
1      Ajay   22   Male  Bengaluru
2    Sanjay   21   Male       Pune
3    Ramesh   31   Male    Chennai

In [74]:
df[(df.Gender=='Male') & (df.Place=='Bengaluru')]

     Name  Age Gender      Place
SNo
1    Ajay   22   Male  Bengaluru

In [75]:
df

       Name  Age  Gender      Place
SNo
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [77]:
df.iloc[:3]

       Name  Age Gender      Place
SNo
1      Ajay   22   Male  Bengaluru
2    Sanjay   21   Male       Pune
3    Ramesh   31   Male    Chennai

In [78]:
df.iloc[2:]

       Name  Age  Gender      Place
SNo
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [79]:
df.iloc[[0,2,4]]

       Name  Age  Gender      Place
SNo
1      Ajay   22    Male  Bengaluru
3    Ramesh   31    Male    Chennai
5     Suman   28  Female     Mumbai

In [80]:
df

       Name  Age  Gender      Place
SNo
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [81]:
df.iloc[:,:3]

       Name  Age  Gender
SNo
1      Ajay   22    Male
2    Sanjay   21    Male
3    Ramesh   31    Male
4     Ramya   24  Female
5     Suman   28  Female

In [82]:
df

       Name  Age  Gender      Place
SNo
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [83]:
df.iloc[[0,1,3],[0,2,3]]

       Name  Gender      Place
SNo
1      Ajay    Male  Bengaluru
2    Sanjay    Male       Pune
4     Ramya  Female  Bengaluru

In [96]:
df.columns.get_loc('Place')

3

In [97]:
df

       Name  Age  Gender      Place
SNo
1      Ajay   22    Male  Bengaluru
2    Sanjay   21    Male       Pune
3    Ramesh   31    Male    Chennai
4     Ramya   24  Female  Bengaluru
5     Suman   28  Female     Mumbai

In [100]:
df.loc[1:3]

       Name  Age Gender      Place
SNo
1      Ajay   22   Male  Bengaluru
2    Sanjay   21   Male       Pune
3    Ramesh   31   Male    Chennai

In [99]:
df.loc[:,'Name':'Gender']

       Name  Age  Gender
SNo
1      Ajay   22    Male
2    Sanjay   21    Male
3    Ramesh   31    Male
4     Ramya   24  Female
5     Suman   28  Female

In [101]:
df.loc[[1,2,5],['Name','Gender']]

       Name  Gender
SNo
1      Ajay    Male
2    Sanjay    Male
5     Suman  Female

In [103]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [104]:
df.Gender.value_counts()

Gender
Male      3
Female    2
Name: count, dtype: int64

In [105]:
df.Gender.mode()

0    Male
Name: Gender, dtype: object

In [106]:
df.Age.max()

31

In [107]:
df.Age.min()

21

In [108]:
df.Age.mean()

np.float64(25.2)

In [109]:
df.Age.median()

24.0